In [1]:
import pandas as pd

In [3]:
data=pd.read_csv("Data/titanic_train.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
data['Age'].head(6)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
Name: Age, dtype: float64

In [8]:
data_row_del=data.dropna(axis=0)
data_row_del['Age'].head(6)

1     38.0
3     35.0
6     54.0
10     4.0
11    58.0
21    34.0
Name: Age, dtype: float64

In [9]:
data.shape, data_row_del.shape

((891, 12), (183, 12))

In [10]:
(data.isnull().sum())/891

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

In [11]:
data_col_del=data.dropna(thresh=500, axis=1)
data_col_del.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [12]:
data.shape, data_col_del.shape

((891, 12), (891, 11))

In [13]:
data['Cabin'].head()

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

In [15]:
data['Cabin'].fillna(value='missing')

0      missing
1          C85
2      missing
3         C123
4      missing
        ...
886    missing
887        B42
888    missing
889       C148
890    missing
Name: Cabin, Length: 891, dtype: object

In [16]:
data['Cabin'].fillna(value=999)

0       999
1       C85
2       999
3      C123
4       999
       ...
886     999
887     B42
888     999
889    C148
890     999
Name: Cabin, Length: 891, dtype: object

In [20]:
data_replace = data.copy() 
data_replace['Age'] = data_replace['Age'].fillna(value=999)
data_replace.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [21]:
(data['Cabin'].isnull()).astype('int')

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    1
889    0
890    1
Name: Cabin, Length: 891, dtype: int32

In [22]:
data_replace['Cabin_na']=(data['Cabin'].isnull()).astype('int')

In [23]:
data_replace.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_na
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

In [24]:
mean_val=data['Age'].mean()
mean_val

29.69911764705882

In [27]:
data_cleaned = data.copy() 
data_cleaned['Age'] = data['Age'].fillna(value = mean_val)
data_cleaned['Age'].isnull().sum()

0

In [28]:
data['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [31]:
mode_val=data['Embarked'].mode()[0]
mode_val

'S'

In [32]:
data_cleaned['Embarked'] = data['Embarked'].fillna(value = mode_val)

In [34]:
data.corr()

ValueError: could not convert string to float: 'Braund, Mr. Owen Harris'

In [35]:
(data[['Name', 'Age']].loc[(data['Age'].isnull()>0)]).head(20)

                                              Name  Age
5                                 Moran, Mr. James  NaN
17                    Williams, Mr. Charles Eugene  NaN
19                         Masselmani, Mrs. Fatima  NaN
26                         Emir, Mr. Farred Chehab  NaN
28                   O'Dwyer, Miss. Ellen "Nellie"  NaN
29                             Todoroff, Mr. Lalio  NaN
31  Spencer, Mrs. William Augustus (Marie Eugenie)  NaN
32                        Glynn, Miss. Mary Agatha  NaN
36                                Mamee, Mr. Hanna  NaN
42                             Kraeff, Mr. Theodor  NaN
45                        Rogers, Mr. William John  NaN
46                               Lennon, Mr. Denis  NaN
47                       O'Driscoll, Miss. Bridget  NaN
48                             Samaan, Mr. Youssef  NaN
55                               Woolner, Mr. Hugh  NaN
64                           Stewart, Mr. Albert A  NaN
65                        Moubarek, Master. Gerios  NaN
76                               Staneff, Mr. Ivan  NaN
77                        Moutal, Mr. Rahamin Haim  NaN
82                  McDermott, Miss. Brigdet Delia  NaN